<?php

namespace Database\Seeders;

use App\Models\DepartmentColor;
use Illuminate\Database\Seeder;

class DepartmentColorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $color = [
            '#557B83',
            '#39AEA9',
            '#A2D5AB',
            '#E5EFC1',
            '#46244C',
            '#C74B50',
            '#D49B54',
            '#712B75',
            '#332FD0',
            '#F0A500',
            '#874356',
            '#019267',
            '#9ADCFF',
            '#008E89',
            '#313552',
            '#FF5959',
            '#161853',
            '#544179',
            '#125C13',
            '#557B83',
            '#90AACB'
        ];
        $names = [
            'الرئيس التنفيذى',
            'اﻹدارة العامة ﻷمن المعلومات',
            'نائب المدير العام',
            'المكتب اﻹدارى',
            'الحوكمة والمخاطر والالتزام',
            'المراقبة اﻷمنية والاستجابة والتحليل',
            'إدارة الحلول اﻷمنية',
            'المعمارية والتخطيط',
            'الحوكمة',
            'المخاطر',
            'الالتزام',
            'المراقبة اﻷمنية',
            'التحليل الرقمى والاستجابة للحوادث',
            'المعلومات الاستخباراتية والتهديدات',
            'تحليل التهديدات والثغرات',
            'إدارة الضوابط التقنية اﻷمنية',
            'تطوير واختبار الحلول اﻷمنية',
            'إدارة الهويات والصلاحيات',
            'التخطيط والتطوير',
            'المعمارية اﻷمنية',
        ];

        foreach ($names as $index => $name) {
            DepartmentColor::create([
                'name' => $name,
                'value' => $color[$index]
            ]);
        }
    }
}
